### Задание 1
Скачайте с сайта grouplens.org...movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [285]:
import pandas as pd

ratings = (pd.read_csv('ratings.csv').query('rating == 5'))

In [331]:
ratings.groupby('movieId').count().sort_values('rating', ascending=False)

         userId  rating  timestamp
movieId
318         153     153        153
296         123     123        123
356         116     116        116
2571        109     109        109
260         104     104        104
...         ...     ...        ...
6732          1       1          1
6731          1       1          1
6713          1       1          1
2066          1       1          1
187717        1       1          1

[2954 rows x 3 columns]

In [307]:
ratings.query('movieId == 318') # Проверка по найденному movieId

       userId  movieId  rating   timestamp
703         6      318     5.0   845553200
1051        8      318     5.0   839463489
1443       15      318     5.0  1510571866
1677       17      318     5.0  1305696465
1797       18      318     5.0  1455049328
...       ...      ...     ...         ...
90454     588      318     5.0   839316184
90490     589      318     5.0   856043369
95867     601      318     5.0  1441639169
96033     602      318     5.0   840875594
98498     607      318     5.0   963080679

[153 rows x 4 columns]

### Задание 2 
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [329]:
data = pd.read_csv('power.csv')

In [330]:
countries_pribaltica = ('Latvia', 'Estonia','Lietuva')
category = ('4','12','21')
year = (range(2005,2010))

filtered_countries = (data.query('country in @countries_pribaltica')
.query('category in @category')
.query('year in @year')
. query('quantity > 0')
)

total_consumption = sum(filtered_countries['quantity'])
print(f'Суммарное потребление: {total_consumption}')

Суммарное потребление: 96960.0

## Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
www.finanz.ru...om-vremeni

https://quote.rbc.ru/?utm_source=topline

In [321]:
page_url = 'https://www.finanz.ru/konverter-valut'
df = pd.read_html(page_url, attrs = {'class': "header_user_pricebox"}, encoding='utf-8')

In [328]:
df

[     0       1     2        3       4     5        6       7     8        9   \
 0  ММВБ   3 822  0,2%   Nasdaq  14 253  0,8%  Биткойн  33 751  4,0%  USD/RUB
 1   РТС   1 646  0,2%   S&P500   4 246  0,5%    Нефть     753  0,7%  EUR/RUB
 2   Dow  33 946  0,2%  FTSE100   7 090  0,4%   Золото   1 783  0,2%  EUR/USD

        10     11
 0  730645   0,2%
 1  870725   0,0%
 2   11927  -0,1%  ]